tukano-artillery-tests/logs/db-nosql-15.txt
--------------------------------
Summary report @ 12:27:11(+0000)
--------------------------------

http.codes.200: ................................................................ 2250
http.codes.204: ................................................................ 1350
http.downloaded_bytes: ......................................................... 178862
http.request_rate: ............................................................. 81/sec
http.requests: ................................................................. 3600
http.response_time:
  min: ......................................................................... 327
  max: ......................................................................... 2418
  mean: ........................................................................ 738.2
  median: ...................................................................... 742.6
  p95: ......................................................................... 1353.1
  p99: ......................................................................... 1686.1
http.response_time.2xx:
  min: ......................................................................... 327
  max: ......................................................................... 2418
  mean: ........................................................................ 738.2
  median: ...................................................................... 742.6
  p95: ......................................................................... 1353.1
  p99: ......................................................................... 1686.1
http.responses: ................................................................ 3600
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/likes?pwd=pwd.codes.200: ..... 450
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd...  450
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/feed?pwd=pwd.codes.200: .. 450
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/followers?pwd=pwd.code...  450
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts.codes.200: ........ 450
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts?pwd=pwd.codes.204:  450
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/{{ random_user_id }}/f...  450
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.codes.200: ....... 450
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/likes?pwd=pwd:
  min: ......................................................................... 718
  max: ......................................................................... 1613
  mean: ........................................................................ 812.8
  median: ...................................................................... 757.6
  p95: ......................................................................... 1107.9
  p99: ......................................................................... 1465.9
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd:
  min: ......................................................................... 813
  max: ......................................................................... 1855
  mean: ........................................................................ 928.8
  median: ...................................................................... 871.5
  p95: ......................................................................... 1249.1
  p99: ......................................................................... 1652.8
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/feed?pwd=pwd:
  min: ......................................................................... 812
  max: ......................................................................... 1867
  mean: ........................................................................ 918.3
  median: ...................................................................... 854.2
  p95: ......................................................................... 1224.4
  p99: ......................................................................... 1587.9
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/followers?pwd=pwd:
  min: ......................................................................... 416
  max: ......................................................................... 1469
  mean: ........................................................................ 488.4
  median: ...................................................................... 450.4
  p95: ......................................................................... 727.9
  p99: ......................................................................... 889.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts:
  min: ......................................................................... 412
  max: ......................................................................... 1457
  mean: ........................................................................ 494
  median: ...................................................................... 450.4
  p95: ......................................................................... 742.6
  p99: ......................................................................... 1249.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts?pwd=pwd:
  min: ......................................................................... 1153
  max: ......................................................................... 2418
  mean: ........................................................................ 1368.8
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1863.5
  p99: ......................................................................... 2101.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/{{ random_user_id }}/followers?pwd=pwd:
  min: ......................................................................... 403
  max: ......................................................................... 1412
  mean: ........................................................................ 498.8
  median: ...................................................................... 459.5
  p95: ......................................................................... 757.6
  p99: ......................................................................... 1274.3
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd=pwd:
  min: ......................................................................... 327
  max: ......................................................................... 1260
  mean: ........................................................................ 395.6
  median: ...................................................................... 347.3
  p95: ......................................................................... 658.6
  p99: ......................................................................... 1224.4
vusers.completed: .............................................................. 450
vusers.created: ................................................................ 450
vusers.created_by_name.DB Storage: ............................................. 450
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5789.5
  max: ......................................................................... 7933.2
  mean: ........................................................................ 6401.7
  median: ...................................................................... 6312.2
  p95: ......................................................................... 7407.5
  p99: ......................................................................... 7557.1